import 'dart:math';

String randomNickname() {
  String adjectives =
      "* 가냘픈* 가는* 가엾은* 가파른* 같은* 거센* 거친* 검은* 게으른* 게을러빠진* 게을러터진* 고달픈* 고른* 고마운* 고운* 고픈* 곧은* 괜찮은* 구석진* 굳은* 굵은* 귀여운* 그런* 그른* 그리운* 기다란* 기쁜* 긴* 깊은* 깎아지른* 깨끗한* 나쁜* 나은* 난데없는* 날랜* 날카로운* 낮은* 너그러운* 너른* 널따란* 넓은* 네모난* 노란* 높은* 누런* 눅은* 느닷없는* 느린* 늦은* 다른* 더러운* 더운* 덜된* 동그란* 돼먹잖은* 된* 둥그런* 둥근* 뒤늦은* 드문* 딱한* 때늦은* 뛰어난* 뜨거운* 막다른* 많은* 매운* 먼* 멋진* 메마른* 메스꺼운* 모난* 못난* 못된* 못생긴* 무거운* 무딘* 무른* 무서운* 미끈미끈한* 미운* 바람직스러운* 반가운* 밝은* 밤늦은* 보드라운* 보람찬* 보잘것없는* 부드러운* 부른* 붉은* 비싼* 빠른* 빨간* 뻘건* 뼈저린* 뽀얀* 뿌연* 새로운* 서툰* 섣부른* 설운* 성가신* 센* 수다스러운* 수줍은* 쉬운* 스스러운* 슬픈* 시원찮은* 싫은* 싼* 쌀쌀맞은* 쏜살같은* 쓰디쓴* 쓰린* 쓴* 아니꼬운* 아닌* 아름다운* 아쉬운* 아픈* 안된* 안쓰러운* 안타까운* 않은* 알맞은* 약빠른* 약은* 얇은* 얕은* 어두운* 어려운* 어린* 언짢은* 엄청난* 없는* 여문* 열띤* 예쁜* 올바른* 옳은* 외로운* 우스운* 의심쩍은* 이른* 익은* 있는* 작은* 잘난* 잘빠진* 잘생긴* 재미있는* 적은* 젊은* 점잖은* 조그만* 좁은* 좋은* 주제넘은* 줄기찬* 즐거운* 지나친* 지혜로운* 질긴* 짓궂은* 짙은* 짠* 짧은* 케케묵은* 큰* 탐스러운* 턱없는* 푸른* 하나같은* 한결같은* 흐린* 희망찬* 흰* 힘겨운* 힘찬";
  String foods =
      "닭볶음탕/야끼만두/아메리카노/등심돈까스/후라이드치킨/고르곤졸라피자/쌀국수/매운크림파스타/짬뽕/마늘보쌈/불고기버거/김치찜/물만두/카페라떼/안심돈까스/양념치킨/고구마피자/소고기쌀국수	/까르보나라/짜장/생굴보쌈/새우버거/제육볶음/군만두/카푸치노/치즈돈까스/간장치킨/포테이토피자/얼큰소고기쌀국수/해물크림파스타/탕수육/홍어삼합/보쌈/빅맥/부대찌개/	찐만두/프라푸치노/치킨가라아게/순살치킨/페퍼로니피자/해물짬뽕/쌀국수/토마토파스타/찹쌀탕수육/훈제오리/보쌈/슈슈버거/찜닭/라볶이/딸기스무디/감자고로케/반반치킨/콤비네이션피자	/짜조/해물토마토파스타/간짜장/보족애/1955버거/닭갈비/떡볶이/바나나스무디/모듬초밥/불고기피자/팟타이/알리오올리오/볶음밥/불족발/더블불고기버거/김치찌개/어묵/키위스무디/활어초밥/나시고랭/봉골레/울면	/냉채족발/에그불고기버거/순두부찌개/어묵튀김/수박스무디/참치초밥/푸팟퐁커리/감바스/삼선간짜장/슈비버거/돼지불고기/김말이	/망고스무디/연어초밥/해물팟타이/포카치아/사천짜장/베토디/계란찜/오징어튀김/카페모카/소고기불초밥/톰얌쌀국수/찹스테이크/삼선짬뽕/치즈버거/메밀국수/새우튀김/자몽에이드/장어초밥/사이공볶음밥/우삽겹도리아/삼선짜장/쿼터파운더치즈/뼈해장국	/순대/홍시주스/새우초밥/사이공볶음면/마르게리따/기스면/붉은대게와퍼/콩국수/순대튀김/딸기주스/계란초밥/딤섬/고르곤졸라/굴짬뽕	/더콰트로치즈/검은콩국수/고추튀김/달고나라떼/유부초밥/크림치즈샐러드/유산슬/통새우와퍼/갈치조림/고구마튀김/달고나밀크티/간장새우/왕만두/와퍼/명태조림/감자튀김/콜드브루	/광어초밥/잡채밥/트러플머쉬룸와퍼/칼국수/만두라면/흑당라떼/도미초밥/삼선볶음밥/치즈와퍼/쌈밥/우동/타로밀크티/소라초밥/새우볶음밥/베이컨치즈와퍼/제육쌈밥/고기만두/아포가토	/모밀소바/마파두부밥/더블와퍼/부대전골/김치만두/딸기플랫치노/잡탕밥/와퍼주니어/김치전골/김치우동/복숭아플랫치노/치즈와퍼주니어/부대전골/김치만두/딸기플랫치노/김치전골/김치우동/복숭아플랫치노/철판쭈꾸미/유부우동	/카라멜마끼아또/쪽갈비/피자치즈라볶이/바닐라라떼/오돌뼈/순대볶음/초콜릿모카/고기비빔국수/핫바/민트모카/비빔국수/닭꼬치/핫초코/김밥/닭강정/아이스초코/멸치고추김밥/찹쌀순대/녹차라떼/치즈김밥/참치주먹밥	/민트초콜릿/참치김밥/토피넛라떼/소고기김밥/고구마라떼/돈가스김밥/콜드키위주스/제육덮밥/복숭아이스티/소고기덮밥	/얼그레이/낙지덮밥/캐모마일/오징어덮밥/페퍼민트티/쫄면/유자차/육개장/감자탕/육회비빔밥/날치주먹밥/김치볶음밥/물냉면/계란말이김밥/샐러드김밥/누드김밥	/참치치즈김밥/떡라면/부대라면/비빔냉면/잔치국수/김치칼국수/수제비/김치수제비/떡국/만두국/떡만두국/아구찜";

  List<String> adjList = adjectives.split("* ");
  List<String> foodList = foods.split("/");
  var random = Random();

  var nickName = adjList[random.nextInt(adjList.length)] + ' ' +
      foodList[random.nextInt(foodList.length)];
  print("닉네임 : $nickName");
  return nickName;
}